### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_key_vault.kv will be created
+   resource "azurerm_key_vault" "kv" {
+       access_policy               = (known after apply)
+       enable_rbac_authorization   = true
+       enabled_for_disk_encryption = true
+       id                          = (known after apply)
+       location                    = "uksouth"
+       name                        = (known after apply)
+       purge_protection_enabled    = false
+       resource_group_name         = "Demo-Inf-Dev-Rg"
+       sku_name                    = "standard"
+       soft_delete_enabled         = (known after apply)
+       soft_delete_retention_days  = 7
+       tags                        = {
+           "Environment"         = "DEV"
+           "GithubRepo"          = "https://github.com/Pwd9000-ML/Azure-Terraform-Deployments"
+           "terraformDeployment" = "true"
        }
+       tenant_id                   = "b4fd7cff-510b-4da5-b133-f7aa6f692ee2"
+       vault_uri                   = (known after apply)

+       network_acls {
+           bypass                     = (known after apply)
+           default_action             = (known after apply)
+           ip_rules                   = (known after apply)
+           virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_resource_group.rg will be created
+   resource "azurerm_resource_group" "rg" {
+       id       = (known after apply)
+       location = "uksouth"
+       name     = "Demo-Inf-Dev-Rg"
+       tags     = {
+           "Environment"         = "DEV"
+           "GithubRepo"          = "https://github.com/Pwd9000-ML/Azure-Terraform-Deployments"
+           "terraformDeployment" = "true"
        }
    }

  # random_integer.kv_num will be created
+   resource "random_integer" "kv_num" {
+       id     = (known after apply)
+       max    = 9999
+       min    = 1
+       result = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>